; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star1)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
)
(:goal (and
	(pointing satellite1 Star7)
	(pointing satellite2 GroundStation3)
	(have_image Phenomenon5 image0)
	(have_image Planet6 image0)
	(have_image Star7 image0)
	(have_image Planet8 image1)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image0)
	(have_image Star13 image1)
	(have_image Planet14 image1)
	(have_image Phenomenon15 image0)
	(have_image Star16 image1)
	(have_image Planet17 image1)
	(have_image Phenomenon18 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 16
2. (turn_to satellite1 star7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star7)
   goals met: 2 of 16
3. (turn_to satellite0 groundstation4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 16
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 16
5. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 16
6. (turn_to satellite0 phenomenon15 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 16
7. (take_image satellite0 phenomenon15 instrument0 image0)
   added: (have_image phenomenon15 image0)
   goals met: 3 of 16
8. (turn_to satellite0 phenomenon12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 16
9. (take_image satellite0 phenomenon12 instrument0 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 16
10. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 16
11. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 16
12. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 16
13. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 6 of 16
14. (turn_to satellite0 phenomenon18 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon18)
   goals met: 6 of 16
15. (take_image satellite0 phenomenon18 instrument0 image1)
   added: (have_image phenomenon18 image1)
   goals met: 7 of 16
16. (turn_to satellite0 phenomenon5 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon5)
   goals met: 7 of 16
17. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   goals met: 8 of 16
18. (turn_to satellite0 phenomenon9 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon9)
   goals met: 8 of 16
19. (take_image satellite0 phenomenon9 instrument0 image1)
   added: (have_image phenomenon9 image1)
   goals met: 9 of 16
20. (turn_to satellite0 planet14 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet14)
   goals met: 9 of 16
21. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 10 of 16
22. (turn_to satellite0 planet17 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet17)
   goals met: 10 of 16
23. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 11 of 16
24. (turn_to satellite0 planet6 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet6)
   goals met: 11 of 16
25. (take_image satellite0 planet6 instrument0 image0)
   added: (have_image planet6 image0)
   goals met: 12 of 16
26. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 12 of 16
27. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 13 of 16
28. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 13 of 16
29. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 14 of 16
30. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 14 of 16
31. (take_image satellite0 star16 instrument0 image1)
   added: (have_image star16 image1)
   goals met: 15 of 16
32. (turn_to satellite0 star7 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star7)
   goals met: 15 of 16
33. (take_image satellite0 star7 instrument0 image0)
   added: (have_image star7 image0)
   goals met: 16 of 16
